{
   "homepage": "https://www.curseforge.com/minecraft/mc-mods/good-nights-sleep",
   "promos": {
      "1.14.4-recommended": "1.0.1",
      "1.14.4-latest": "1.0.1",
      "1.13.2-recommended": "0.0.2",
      "1.13.2-latest": "0.0.2",
      "1.12.2-recommended": "0.2.2",
      "1.12.2-latest": "0.2.2",
      "1.6.4-recommended": "b2.3.2",
      "1.6.4-latest": "b2.3.2",
      "1.6.2-recommended": "b2.3",
      "1.6.2-latest": "b2.3",
      "1.5.2-recommended": "a1.0",
      "1.5.2-latest": "a1.0"
   },
   "1.14.4": {
      "1.0.1": "- Fixed beds exploding in both dimensions.\n- Fixed having a chance to spawn in lava when entering the Nightmare dimension.\n- Added Biome Dictionary tags.\n- Nerfed Negatite, lowering it's attack speed, and durrability.\n- Fixed spawning on top of a structure when returning to the overworld. (if your bed was in a structure)\n- Hoes work in multiplayer properly.\n"
   },
   "1.12.2": {
      "0.0.1": "- Ported to 1.12.2"
   },
   "1.6.4": {
      "b2.3.2": "- Stews now work in the nightmare again\n- Strange bed no longer crashes game upon clicking on it\n- Added a goodnightssleep config directory\n- Added a DataGNS file\n- Increased compatibility with other biome mods (new biome id generator method)\n- Updated for 1.6.4 compatibility; this does not work with 1.6.2!\n- Enirboreh evomer ot deliaf\n- There is a derpy big tree gen bug that makes the big trees look like lollipops.\n- Armor textures for nightmare materials have not been added yet.\n- Server compatibility has only recently been added, so there may be some notable bugs on a modded server.\n"
   },
   "1.6.2": {
      "b2.3": "- Added Tormenter with AI similar to that of zombies. They drop Necrum\n- server capability added\n- dead wood recipe bug\n- XP bar no longer seemingly empties upon entering a dream\n- chance of Rainbow Ore dropping itself is changed to 50%\n- Rainbow Ore does not drop coal anymore\n- increased compatibility of dream dimension id's by setting them to 242 and -242 instead of 2 and -2\n",
      "b2.2.3": "- fixed bug in which the negatite pickaxe was replaced with a negatite axe\n- Lolipops are in item form in the decorations tab,\n- There is a derpy big tree gen bug that makes the big trees look like lollipops.\n- Armor textures for nightmare materials have not been added yet.\n- ID assigning methods are brand new and may have some issues when used with certain mods. Please tell me if this happens!\n- This mod is not server-compatible\n",
      "b2.2": "- Added method that automatically assigns item ID's if they are incompatible with other ID's\n- Added method that automatically assigns block ID's if they are incompatible with other ID's\n- Added ItemGNS.cfg file created on startup that allows alteration of itemID's\n- Added BlockGNS.cfg file created on startup that allows alteration of block ID's\n- Fixed a bug preventing players from mining shadow stones or negatite blocks\n- Enirboreh evomer ot deliaf\n- There is a derpy big tree gen bug that makes the big trees look like lollipops.\n- Armor textures for nightmare materials have not been added yet.\n- ID assigning methods are brand new and may have some issues when used with certain mods. Please tell me if this happens!\n- This mod is not server-compatible\n- Negatite pick axe is replaced with another negatite axe\n",
      "b2.1": "- players will spawn on overworld grass platforms in the nightmare\n- beds will now set the player's spawn point\n- limited dream time, players are teleported back after 20 min\n- luxurious and wretched stew\n- stews can transfer players to overworld if consumed in opposite dream\n- stews can reset dream timer if consumed in corresponding dream\n- made negatite items less durable and candy armor slightly more durable\n- added necrum tools for nightmare (rotting tissue material)\n- added zitrite tools for nightmare (darkness material)\n- nightmare tools are unenchantable\n- reduced zombie pigman spawn rate in nightmare\n- added silverfish, witches, and blazes to the nightmare\n- tried and failed to add giant zombies. But you can still have a spawn egg!\n- zitrite ore is smelted into zitrite ingots to craft zitrite items\n- zitrite and necrum ores spawn in the nightmare\n- stews are craftable\n- improved clicking on the beds, using a totally different event method to teleport the player\n- stews aren't consumed when in creative mode, but still have same effect\n- candy is converted directly to powdered sugar, and necrum is converted directly to necrotic extract\n- added Solid Necrum, which is crafted from 4 necrum (parallel to hard candy)\n- added Negatite and Zitrite blocks\n- added a strange bed, which teleports players to a dream at random; it is crafted from a hope, despair, and bed\n- luxurious/wretched beds are now crafted from one bed and one positite/negatite\n- improved special mushroom generation in overworld\n- removed bed generation in overworld\n- enirboreh evomer ot deliaf\n- There is a derpy big tree gen bug that makes the big trees look like lollipops.\n- Armor textures for nightmare materials have not been added yet.\n- Do you hear that noise? WAIT! COULD THAT BE - ...\n",
      "b1.0": "- nighmare trees\n- gumdrop = seeds texture bug is no more\n- despair mushrooms should use other item to grow, necrotic extract\n- necrotic extract (recipe: 1 zombie flesh)\n- repairable tools\n- Positite tool names!\n- fixed multiblock textures\n- made nightmare presentable\n- Nightmare grass\n- bed overworld gen (1/100 chance per chunk, assuming flat terrain)\n- make compatible with 1.6.2\n- Nightmare mushroom gen\n- Nightmare has a visible moon\n- grass gen in nightmare\n- tree gen in nightmare\n- NIGHTMARE GRASS IS EVIL!!! >:D\n- got rid of bats in good dream\n- fixed baby creeper ghost bug\n- new bed recipe\n- made item/block id's more compatible with other mods\n- negatite tools\n- negatite ore yields negatite\n- generations for negatite ore\n- corrected positite hoe texture\n- added \"nether splashes\" to nightmare\n- made nightmare more hilly\n- temporarily removed herobrine\n"
   },
   "1.5.2": {
      "a1.0": "- Updated from 1.4.2 to 1.5.2. I will post the 1.6.2 version very soon.\n- Many bugs, this is only Alpha. Many will be fixed by Beta.\n"
   }
}